#+begin_comment
Common options can be called easily with =C-c C-e #=
#+end_comment

#+begin_comment
if you want to see images inline by default
#+end_comment
#+startup: inlineimages

#+begin_comment
this allows me to place the toc where I want, with
#+TOC: headlines 2
at the place I want
#+end_comment
#+OPTIONS: toc:nil

#+begin_comment
see 
https://orgmode.org/manual/Export-Settings.html
to know what options you have
for instance you could do:
#+OPTIONS: toc:nil date:nil 
#+end_comment

#+author: 
#+latex_class: article
#+latex_class_options: [a4paper]
#+title: Org mode export magic!
#+subtitle: Making your life easy after taking a (sometimes tiring, I agree) night to configure org export.
#+latex_compiler: pdflatex
#+date: \today
#+language: fr

#+latex_header: \usepackage[utf8]{inputenc} %% For unicode chars
#+latex_header: \renewcommand*{\contentsname}{Sommaire} %% to change toc name

#+begin_comment
% for [H] and things like that
#+end_comment
#+latex_header: \usepackage{float}
Thanks for reading :D

#+TOC: headlines 2

* Pdf opening
Editing your pdf and viewing the result in emacs is even more
pleasant, you can open you pdfs in emacs, even after an export by
using:

#+begin_src emacs-lisp 
(use-package org-pdftools
  :hook (org-mode . org-pdftools-setup-link))

(add-to-list 'org-file-apps 
             '("\\.pdf\\'" . (lambda (file link)
                                     (org-pdftools-open link))))
#+end_src

#+RESULTS:
: ((\.pdf\' lambda (file link) (org-pdftools-open link)) (auto-mode . emacs) (directory . emacs) (\.mm\' . default) (\.x?html?\' . default) (\.pdf\' . default))

in your init file

and yeah, you can put source code in your pdf. This code can be
highlighted with minted for instance, but I don't know how :). You can
also ask org to show the results on the pdf too! By putting\\
=:results output :exports result= \\
after your\\
=#+begin_src python=\\
in orgmode
------------
:todo:
#+begin_src python :results output :exports result
def f(a, b, c):
    d = a+b+c
    return d
print( f(1,2,5) )

#+end_src

#+RESULTS:
: 8

And here is the result!

------------

